---
title: SpotDimension
classe: Autodesk.Revit.DB.SpotDimension
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Dimension
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# SpotDimension

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean LeaderHasShoulder { get; set; }` | `spotDimension.LeaderHasShoulder` | Boolean |
| `XYZ LeaderShoulderPosition { get; set; }` | `spotDimension.LeaderShoulderPosition` | XYZ |
| `SpotDimensionType SpotDimensionType { get; set; }` | `spotDimension.SpotDimensionType` | SpotDimensionType |
| `Boolean CanFlip()` | `spotDimension.CanFlip()` | Boolean |
| `Void Flip()` | `spotDimension.Flip()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```